mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2gkxh/common/s6e2gkxh.h
/*******************************************************************************
* BT Registers BT11
*   Register Definition
*******************************************************************************/
#define FM_BT11_PPG_PRLL                          *((volatile uint16_t*)(0x400254C0UL))
#define FM4_BT11_PPG_PRLL                         *((volatile uint16_t*)(0x400254C0UL))
#define FM_BT11_PWM_PCSR                          *((volatile uint16_t*)(0x400254C0UL))
#define FM4_BT11_PWM_PCSR                         *((volatile uint16_t*)(0x400254C0UL))
#define FM_BT11_RT_PCSR                           *((volatile uint16_t*)(0x400254C0UL))
#define FM4_BT11_RT_PCSR                          *((volatile uint16_t*)(0x400254C0UL))
#define FM_BT11_PPG_PRLH                          *((volatile uint16_t*)(0x400254C4UL))
#define FM4_BT11_PPG_PRLH                         *((volatile uint16_t*)(0x400254C4UL))
#define FM_BT11_PWC_DTBF                          *((volatile uint16_t*)(0x400254C4UL))
#define FM4_BT11_PWC_DTBF                         *((volatile uint16_t*)(0x400254C4UL))
#define FM_BT11_PWM_PDUT                          *((volatile uint16_t*)(0x400254C4UL))
#define FM4_BT11_PWM_PDUT                         *((volatile uint16_t*)(0x400254C4UL))
#define FM_BT11_PPG_TMR                           *((volatile uint16_t*)(0x400254C8UL))
#define FM4_BT11_PPG_TMR                          *((volatile uint16_t*)(0x400254C8UL))
#define FM_BT11_PWM_TMR                           *((volatile uint16_t*)(0x400254C8UL))
#define FM4_BT11_PWM_TMR                          *((volatile uint16_t*)(0x400254C8UL))
#define FM_BT11_RT_TMR                            *((volatile uint16_t*)(0x400254C8UL))
#define FM4_BT11_RT_TMR                           *((volatile uint16_t*)(0x400254C8UL))
#define FM_BT11_PPG_TMCR                          *((volatile uint16_t*)(0x400254CCUL))
#define FM4_BT11_PPG_TMCR                         *((volatile uint16_t*)(0x400254CCUL))
#define FM_BT11_PWC_TMCR                          *((volatile uint16_t*)(0x400254CCUL))
#define FM4_BT11_PWC_TMCR                         *((volatile uint16_t*)(0x400254CCUL))
#define FM_BT11_PWM_TMCR                          *((volatile uint16_t*)(0x400254CCUL))
#define FM4_BT11_PWM_TMCR                         *((volatile uint16_t*)(0x400254CCUL))
#define FM_BT11_RT_TMCR                           *((volatile uint16_t*)(0x400254CCUL))
#define FM4_BT11_RT_TMCR                          *((volatile uint16_t*)(0x400254CCUL))
#define FM_BT11_PPG_STC                           *((volatile  uint8_t*)(0x400254D0UL))
#define FM4_BT11_PPG_STC                          *((volatile  uint8_t*)(0x400254D0UL))
#define FM_BT11_PWC_STC                           *((volatile  uint8_t*)(0x400254D0UL))
#define FM4_BT11_PWC_STC                          *((volatile  uint8_t*)(0x400254D0UL))
#define FM_BT11_PWM_STC                           *((volatile  uint8_t*)(0x400254D0UL))
#define FM4_BT11_PWM_STC                          *((volatile  uint8_t*)(0x400254D0UL))
#define FM_BT11_RT_STC                            *((volatile  uint8_t*)(0x400254D0UL))
#define FM4_BT11_RT_STC                           *((volatile  uint8_t*)(0x400254D0UL))
#define FM_BT11_PPG_TMCR2                         *((volatile  uint8_t*)(0x400254D1UL))
#define FM4_BT11_PPG_TMCR2                        *((volatile  uint8_t*)(0x400254D1UL))
#define FM_BT11_PWC_TMCR2                         *((volatile  uint8_t*)(0x400254D1UL))
#define FM4_BT11_PWC_TMCR2                        *((volatile  uint8_t*)(0x400254D1UL))
#define FM_BT11_PWM_TMCR2                         *((volatile  uint8_t*)(0x400254D1UL))
#define FM4_BT11_PWM_TMCR2                        *((volatile  uint8_t*)(0x400254D1UL))
#define FM_BT11_RT_TMCR2                          *((volatile  uint8_t*)(0x400254D1UL))
#define FM4_BT11_RT_TMCR2                         *((volatile  uint8_t*)(0x400254D1UL))

/*******************************************************************************
* BT Registers BT12
*   Register Definition
*******************************************************************************/
#define FM_BT12_PPG_PRLL                          *((volatile uint16_t*)(0x40025600UL))
#define FM4_BT12_PPG_PRLL                         *((volatile uint16_t*)(0x40025600UL))
#define FM_BT12_PWM_PCSR                          *((volatile uint16_t*)(0x40025600UL))
#define FM4_BT12_PWM_PCSR                         *((volatile uint16_t*)(0x40025600UL))
#define FM_BT12_RT_PCSR                           *((volatile uint16_t*)(0x40025600UL))
#define FM4_BT12_RT_PCSR                          *((volatile uint16_t*)(0x40025600UL))
#define FM_BT12_PPG_PRLH                          *((volatile uint16_t*)(0x40025604UL))
#define FM4_BT12_PPG_PRLH                         *((volatile uint16_t*)(0x40025604UL))
#define FM_BT12_PWC_DTBF                          *((volatile uint16_t*)(0x40025604UL))
#define FM4_BT12_PWC_DTBF                         *((volatile uint16_t*)(0x40025604UL))
#define FM_BT12_PWM_PDUT                          *((volatile uint16_t*)(0x40025604UL))
#define FM4_BT12_PWM_PDUT                         *((volatile uint16_t*)(0x40025604UL))
#define FM_BT12_PPG_TMR                           *((volatile uint16_t*)(0x40025608UL))
#define FM4_BT12_PPG_TMR                          *((volatile uint16_t*)(0x40025608UL))
#define FM_BT12_PWM_TMR                           *((volatile uint16_t*)(0x40025608UL))
#define FM4_BT12_PWM_TMR                          *((volatile uint16_t*)(0x40025608UL))
#define FM_BT12_RT_TMR                            *((volatile uint16_t*)(0x40025608UL))
#define FM4_BT12_RT_TMR                           *((volatile uint16_t*)(0x40025608UL))
#define FM_BT12_PPG_TMCR                          *((volatile uint16_t*)(0x4002560CUL))
#define FM4_BT12_PPG_TMCR                         *((volatile uint16_t*)(0x4002560CUL))
#define FM_BT12_PWC_TMCR                          *((volatile uint16_t*)(0x4002560CUL))
#define FM4_BT12_PWC_TMCR                         *((volatile uint16_t*)(0x4002560CUL))
#define FM_BT12_PWM_TMCR                          *((volatile uint16_t*)(0x4002560CUL))
#define FM4_BT12_PWM_TMCR                         *((volatile uint16_t*)(0x4002560CUL))
#define FM_BT12_RT_TMCR                           *((volatile uint16_t*)(0x4002560CUL))
#define FM4_BT12_RT_TMCR                          *((volatile uint16_t*)(0x4002560CUL))
#define FM_BT12_PPG_STC                           *((volatile  uint8_t*)(0x40025610UL))
#define FM4_BT12_PPG_STC                          *((volatile  uint8_t*)(0x40025610UL))
#define FM_BT12_PWC_STC                           *((volatile  uint8_t*)(0x40025610UL))
#define FM4_BT12_PWC_STC                          *((volatile  uint8_t*)(0x40025610UL))
#define FM_BT12_PWM_STC                           *((volatile  uint8_t*)(0x40025610UL))
#define FM4_BT12_PWM_STC                          *((volatile  uint8_t*)(0x40025610UL))
#define FM_BT12_RT_STC                            *((volatile  uint8_t*)(0x40025610UL))
#define FM4_BT12_RT_STC                           *((volatile  uint8_t*)(0x40025610UL))
#define FM_BT12_PPG_TMCR2                         *((volatile  uint8_t*)(0x40025611UL))
#define FM4_BT12_PPG_TMCR2                        *((volatile  uint8_t*)(0x40025611UL))
#define FM_BT12_PWC_TMCR2                         *((volatile  uint8_t*)(0x40025611UL))
#define FM4_BT12_PWC_TMCR2                        *((volatile  uint8_t*)(0x40025611UL))
#define FM_BT12_PWM_TMCR2                         *((volatile  uint8_t*)(0x40025611UL))
#define FM4_BT12_PWM_TMCR2                        *((volatile  uint8_t*)(0x40025611UL))
#define FM_BT12_RT_TMCR2                          *((volatile  uint8_t*)(0x40025611UL))
#define FM4_BT12_RT_TMCR2                         *((volatile  uint8_t*)(0x40025611UL))

