mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2gkxh/common/s6e2gkxh.h
/*******************************************************************************
* USB Registers USB1
*   Register Definition
*******************************************************************************/
#define FM_USB1_HCNT                              *((volatile uint16_t*)(0x40054200UL))
#define FM4_USB1_HCNT                             *((volatile uint16_t*)(0x40054200UL))
#define FM_USB1_HIRQ                              *((volatile  uint8_t*)(0x40054204UL))
#define FM4_USB1_HIRQ                             *((volatile  uint8_t*)(0x40054204UL))
#define FM_USB1_HERR                              *((volatile  uint8_t*)(0x40054205UL))
#define FM4_USB1_HERR                             *((volatile  uint8_t*)(0x40054205UL))
#define FM_USB1_HSTATE                            *((volatile  uint8_t*)(0x40054208UL))
#define FM4_USB1_HSTATE                           *((volatile  uint8_t*)(0x40054208UL))
#define FM_USB1_HFCOMP                            *((volatile  uint8_t*)(0x40054209UL))
#define FM4_USB1_HFCOMP                           *((volatile  uint8_t*)(0x40054209UL))
#define FM_USB1_HRTIMER                           *((volatile uint16_t*)(0x4005420CUL))
#define FM4_USB1_HRTIMER                          *((volatile uint16_t*)(0x4005420CUL))
#define FM_USB1_HRTIMER2                          *((volatile  uint8_t*)(0x40054210UL))
#define FM4_USB1_HRTIMER2                         *((volatile  uint8_t*)(0x40054210UL))
#define FM_USB1_HADR                              *((volatile  uint8_t*)(0x40054211UL))
#define FM4_USB1_HADR                             *((volatile  uint8_t*)(0x40054211UL))
#define FM_USB1_HEOF                              *((volatile uint16_t*)(0x40054214UL))
#define FM4_USB1_HEOF                             *((volatile uint16_t*)(0x40054214UL))
#define FM_USB1_HFRAME                            *((volatile uint16_t*)(0x40054218UL))
#define FM4_USB1_HFRAME                           *((volatile uint16_t*)(0x40054218UL))
#define FM_USB1_HTOKEN                            *((volatile  uint8_t*)(0x4005421CUL))
#define FM4_USB1_HTOKEN                           *((volatile  uint8_t*)(0x4005421CUL))
#define FM_USB1_UDCC                              *((volatile uint16_t*)(0x40054220UL))
#define FM4_USB1_UDCC                             *((volatile uint16_t*)(0x40054220UL))
#define FM_USB1_EP0C                              *((volatile uint16_t*)(0x40054224UL))
#define FM4_USB1_EP0C                             *((volatile uint16_t*)(0x40054224UL))
#define FM_USB1_EP1C                              *((volatile uint16_t*)(0x40054228UL))
#define FM4_USB1_EP1C                             *((volatile uint16_t*)(0x40054228UL))
#define FM_USB1_EP2C                              *((volatile uint16_t*)(0x4005422CUL))
#define FM4_USB1_EP2C                             *((volatile uint16_t*)(0x4005422CUL))
#define FM_USB1_EP3C                              *((volatile uint16_t*)(0x40054230UL))
#define FM4_USB1_EP3C                             *((volatile uint16_t*)(0x40054230UL))
#define FM_USB1_EP4C                              *((volatile uint16_t*)(0x40054234UL))
#define FM4_USB1_EP4C                             *((volatile uint16_t*)(0x40054234UL))
#define FM_USB1_EP5C                              *((volatile uint16_t*)(0x40054238UL))
#define FM4_USB1_EP5C                             *((volatile uint16_t*)(0x40054238UL))
#define FM_USB1_TMSP                              *((volatile uint16_t*)(0x4005423CUL))
#define FM4_USB1_TMSP                             *((volatile uint16_t*)(0x4005423CUL))
#define FM_USB1_UDCS                              *((volatile  uint8_t*)(0x40054240UL))
#define FM4_USB1_UDCS                             *((volatile  uint8_t*)(0x40054240UL))
#define FM_USB1_UDCIE                             *((volatile  uint8_t*)(0x40054241UL))
#define FM4_USB1_UDCIE                            *((volatile  uint8_t*)(0x40054241UL))
#define FM_USB1_EP0IS                             *((volatile uint16_t*)(0x40054244UL))
#define FM4_USB1_EP0IS                            *((volatile uint16_t*)(0x40054244UL))
#define FM_USB1_EP0OS                             *((volatile uint16_t*)(0x40054248UL))
#define FM4_USB1_EP0OS                            *((volatile uint16_t*)(0x40054248UL))
#define FM_USB1_EP1S                              *((volatile uint16_t*)(0x4005424CUL))
#define FM4_USB1_EP1S                             *((volatile uint16_t*)(0x4005424CUL))
#define FM_USB1_EP2S                              *((volatile uint16_t*)(0x40054250UL))
#define FM4_USB1_EP2S                             *((volatile uint16_t*)(0x40054250UL))
#define FM_USB1_EP3S                              *((volatile uint16_t*)(0x40054254UL))
#define FM4_USB1_EP3S                             *((volatile uint16_t*)(0x40054254UL))
#define FM_USB1_EP4S                              *((volatile uint16_t*)(0x40054258UL))
#define FM4_USB1_EP4S                             *((volatile uint16_t*)(0x40054258UL))
#define FM_USB1_EP5S                              *((volatile uint16_t*)(0x4005425CUL))
#define FM4_USB1_EP5S                             *((volatile uint16_t*)(0x4005425CUL))
#define FM_USB1_EP0DT                             *((volatile uint16_t*)(0x40054260UL))
#define FM4_USB1_EP0DT                            *((volatile uint16_t*)(0x40054260UL))
#define FM_USB1_EP1DT                             *((volatile uint16_t*)(0x40054264UL))
#define FM4_USB1_EP1DT                            *((volatile uint16_t*)(0x40054264UL))
#define FM_USB1_EP2DT                             *((volatile uint16_t*)(0x40054268UL))
#define FM4_USB1_EP2DT                            *((volatile uint16_t*)(0x40054268UL))
#define FM_USB1_EP3DT                             *((volatile uint16_t*)(0x4005426CUL))
#define FM4_USB1_EP3DT                            *((volatile uint16_t*)(0x4005426CUL))
#define FM_USB1_EP4DT                             *((volatile uint16_t*)(0x40054270UL))
#define FM4_USB1_EP4DT                            *((volatile uint16_t*)(0x40054270UL))
#define FM_USB1_EP5DT                             *((volatile uint16_t*)(0x40054274UL))
#define FM4_USB1_EP5DT                            *((volatile uint16_t*)(0x40054274UL))

