mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2gkxh/common/s6e2gkxh.h
#define bFM_MFS9_CSIO_SCSFR2_CS3SPI               *((volatile  uint8_t *)(0x42712714UL))
#define bFM4_MFS9_CSIO_SCSFR2_CS3SPI              *((volatile  uint8_t *)(0x42712714UL))
#define bFM_MFS9_CSIO_SCSFR2_CS3SCINV             *((volatile  uint8_t *)(0x42712718UL))
#define bFM4_MFS9_CSIO_SCSFR2_CS3SCINV            *((volatile  uint8_t *)(0x42712718UL))
#define bFM_MFS9_CSIO_SCSFR2_CS3CSLVL             *((volatile  uint8_t *)(0x4271271CUL))
#define bFM4_MFS9_CSIO_SCSFR2_CS3CSLVL            *((volatile  uint8_t *)(0x4271271CUL))

#define bFM_MFS9_CSIO_SMR_SOE                     *((volatile  uint8_t *)(0x42712000UL))
#define bFM4_MFS9_CSIO_SMR_SOE                    *((volatile  uint8_t *)(0x42712000UL))
#define bFM_MFS9_CSIO_SMR_SCKE                    *((volatile  uint8_t *)(0x42712004UL))
#define bFM4_MFS9_CSIO_SMR_SCKE                   *((volatile  uint8_t *)(0x42712004UL))
#define bFM_MFS9_CSIO_SMR_BDS                     *((volatile  uint8_t *)(0x42712008UL))
#define bFM4_MFS9_CSIO_SMR_BDS                    *((volatile  uint8_t *)(0x42712008UL))
#define bFM_MFS9_CSIO_SMR_SCINV                   *((volatile  uint8_t *)(0x4271200CUL))
#define bFM4_MFS9_CSIO_SMR_SCINV                  *((volatile  uint8_t *)(0x4271200CUL))

#define bFM_MFS9_CSIO_SSR_TBI                     *((volatile  uint8_t *)(0x427120A0UL))
#define bFM4_MFS9_CSIO_SSR_TBI                    *((volatile  uint8_t *)(0x427120A0UL))
#define bFM_MFS9_CSIO_SSR_TDRE                    *((volatile  uint8_t *)(0x427120A4UL))
#define bFM4_MFS9_CSIO_SSR_TDRE                   *((volatile  uint8_t *)(0x427120A4UL))
#define bFM_MFS9_CSIO_SSR_RDRF                    *((volatile  uint8_t *)(0x427120A8UL))
#define bFM4_MFS9_CSIO_SSR_RDRF                   *((volatile  uint8_t *)(0x427120A8UL))
#define bFM_MFS9_CSIO_SSR_ORE                     *((volatile  uint8_t *)(0x427120ACUL))
#define bFM4_MFS9_CSIO_SSR_ORE                    *((volatile  uint8_t *)(0x427120ACUL))
#define bFM_MFS9_CSIO_SSR_AWC                     *((volatile  uint8_t *)(0x427120B0UL))
#define bFM4_MFS9_CSIO_SSR_AWC                    *((volatile  uint8_t *)(0x427120B0UL))
#define bFM_MFS9_CSIO_SSR_REC                     *((volatile  uint8_t *)(0x427120BCUL))
#define bFM4_MFS9_CSIO_SSR_REC                    *((volatile  uint8_t *)(0x427120BCUL))

#define bFM_MFS9_I2C_EIBCR_BEC                    *((volatile  uint8_t *)(0x427123A0UL))
#define bFM4_MFS9_I2C_EIBCR_BEC                   *((volatile  uint8_t *)(0x427123A0UL))
#define bFM_MFS9_I2C_EIBCR_SOCE                   *((volatile  uint8_t *)(0x427123A4UL))
#define bFM4_MFS9_I2C_EIBCR_SOCE                  *((volatile  uint8_t *)(0x427123A4UL))
#define bFM_MFS9_I2C_EIBCR_SCLC                   *((volatile  uint8_t *)(0x427123A8UL))
#define bFM4_MFS9_I2C_EIBCR_SCLC                  *((volatile  uint8_t *)(0x427123A8UL))
#define bFM_MFS9_I2C_EIBCR_SDAC                   *((volatile  uint8_t *)(0x427123ACUL))
#define bFM4_MFS9_I2C_EIBCR_SDAC                  *((volatile  uint8_t *)(0x427123ACUL))
#define bFM_MFS9_I2C_EIBCR_SCLS                   *((volatile  uint8_t *)(0x427123B0UL))
#define bFM4_MFS9_I2C_EIBCR_SCLS                  *((volatile  uint8_t *)(0x427123B0UL))
#define bFM_MFS9_I2C_EIBCR_SDAS                   *((volatile  uint8_t *)(0x427123B4UL))
#define bFM4_MFS9_I2C_EIBCR_SDAS                  *((volatile  uint8_t *)(0x427123B4UL))

#define bFM_MFS9_I2C_FCR_FE1                      *((volatile  uint8_t *)(0x42712280UL))
#define bFM4_MFS9_I2C_FCR_FE1                     *((volatile  uint8_t *)(0x42712280UL))
#define bFM_MFS9_I2C_FCR_FE2                      *((volatile  uint8_t *)(0x42712284UL))
#define bFM4_MFS9_I2C_FCR_FE2                     *((volatile  uint8_t *)(0x42712284UL))
#define bFM_MFS9_I2C_FCR_FCL1                     *((volatile  uint8_t *)(0x42712288UL))
#define bFM4_MFS9_I2C_FCR_FCL1                    *((volatile  uint8_t *)(0x42712288UL))
#define bFM_MFS9_I2C_FCR_FCL2                     *((volatile  uint8_t *)(0x4271228CUL))
#define bFM4_MFS9_I2C_FCR_FCL2                    *((volatile  uint8_t *)(0x4271228CUL))
#define bFM_MFS9_I2C_FCR_FSET                     *((volatile  uint8_t *)(0x42712290UL))
#define bFM4_MFS9_I2C_FCR_FSET                    *((volatile  uint8_t *)(0x42712290UL))
#define bFM_MFS9_I2C_FCR_FLD                      *((volatile  uint8_t *)(0x42712294UL))
#define bFM4_MFS9_I2C_FCR_FLD                     *((volatile  uint8_t *)(0x42712294UL))
#define bFM_MFS9_I2C_FCR_FLST                     *((volatile  uint8_t *)(0x42712298UL))
#define bFM4_MFS9_I2C_FCR_FLST                    *((volatile  uint8_t *)(0x42712298UL))
#define bFM_MFS9_I2C_FCR_FSEL                     *((volatile  uint8_t *)(0x427122A0UL))
#define bFM4_MFS9_I2C_FCR_FSEL                    *((volatile  uint8_t *)(0x427122A0UL))
#define bFM_MFS9_I2C_FCR_FTIE                     *((volatile  uint8_t *)(0x427122A4UL))
#define bFM4_MFS9_I2C_FCR_FTIE                    *((volatile  uint8_t *)(0x427122A4UL))
#define bFM_MFS9_I2C_FCR_FDRQ                     *((volatile  uint8_t *)(0x427122A8UL))
#define bFM4_MFS9_I2C_FCR_FDRQ                    *((volatile  uint8_t *)(0x427122A8UL))
#define bFM_MFS9_I2C_FCR_FRIIE                    *((volatile  uint8_t *)(0x427122ACUL))
#define bFM4_MFS9_I2C_FCR_FRIIE                   *((volatile  uint8_t *)(0x427122ACUL))
#define bFM_MFS9_I2C_FCR_FLSTE                    *((volatile  uint8_t *)(0x427122B0UL))
#define bFM4_MFS9_I2C_FCR_FLSTE                   *((volatile  uint8_t *)(0x427122B0UL))

#define bFM_MFS9_I2C_IBCR_INT                     *((volatile  uint8_t *)(0x42712020UL))
#define bFM4_MFS9_I2C_IBCR_INT                    *((volatile  uint8_t *)(0x42712020UL))
#define bFM_MFS9_I2C_IBCR_BER                     *((volatile  uint8_t *)(0x42712024UL))
#define bFM4_MFS9_I2C_IBCR_BER                    *((volatile  uint8_t *)(0x42712024UL))
#define bFM_MFS9_I2C_IBCR_INTE                    *((volatile  uint8_t *)(0x42712028UL))
#define bFM4_MFS9_I2C_IBCR_INTE                   *((volatile  uint8_t *)(0x42712028UL))
#define bFM_MFS9_I2C_IBCR_CNDE                    *((volatile  uint8_t *)(0x4271202CUL))
#define bFM4_MFS9_I2C_IBCR_CNDE                   *((volatile  uint8_t *)(0x4271202CUL))
#define bFM_MFS9_I2C_IBCR_WSEL                    *((volatile  uint8_t *)(0x42712030UL))
#define bFM4_MFS9_I2C_IBCR_WSEL                   *((volatile  uint8_t *)(0x42712030UL))
#define bFM_MFS9_I2C_IBCR_ACKE                    *((volatile  uint8_t *)(0x42712034UL))
#define bFM4_MFS9_I2C_IBCR_ACKE                   *((volatile  uint8_t *)(0x42712034UL))
#define bFM_MFS9_I2C_IBCR_ACT_SCC                 *((volatile  uint8_t *)(0x42712038UL))
#define bFM4_MFS9_I2C_IBCR_ACT_SCC                *((volatile  uint8_t *)(0x42712038UL))
#define bFM_MFS9_I2C_IBCR_MSS                     *((volatile  uint8_t *)(0x4271203CUL))
#define bFM4_MFS9_I2C_IBCR_MSS                    *((volatile  uint8_t *)(0x4271203CUL))

#define bFM_MFS9_I2C_IBSR_BB                      *((volatile  uint8_t *)(0x42712080UL))
#define bFM4_MFS9_I2C_IBSR_BB                     *((volatile  uint8_t *)(0x42712080UL))
#define bFM_MFS9_I2C_IBSR_SPC                     *((volatile  uint8_t *)(0x42712084UL))
#define bFM4_MFS9_I2C_IBSR_SPC                    *((volatile  uint8_t *)(0x42712084UL))
#define bFM_MFS9_I2C_IBSR_RSC                     *((volatile  uint8_t *)(0x42712088UL))
#define bFM4_MFS9_I2C_IBSR_RSC                    *((volatile  uint8_t *)(0x42712088UL))
#define bFM_MFS9_I2C_IBSR_AL                      *((volatile  uint8_t *)(0x4271208CUL))
#define bFM4_MFS9_I2C_IBSR_AL                     *((volatile  uint8_t *)(0x4271208CUL))
#define bFM_MFS9_I2C_IBSR_TRX                     *((volatile  uint8_t *)(0x42712090UL))
#define bFM4_MFS9_I2C_IBSR_TRX                    *((volatile  uint8_t *)(0x42712090UL))
#define bFM_MFS9_I2C_IBSR_RSA                     *((volatile  uint8_t *)(0x42712094UL))
#define bFM4_MFS9_I2C_IBSR_RSA                    *((volatile  uint8_t *)(0x42712094UL))
#define bFM_MFS9_I2C_IBSR_RACK                    *((volatile  uint8_t *)(0x42712098UL))
#define bFM4_MFS9_I2C_IBSR_RACK                   *((volatile  uint8_t *)(0x42712098UL))
#define bFM_MFS9_I2C_IBSR_FBT                     *((volatile  uint8_t *)(0x4271209CUL))
#define bFM4_MFS9_I2C_IBSR_FBT                    *((volatile  uint8_t *)(0x4271209CUL))

#define bFM_MFS9_I2C_ISBA_SAEN                    *((volatile  uint8_t *)(0x4271221CUL))
#define bFM4_MFS9_I2C_ISBA_SAEN                   *((volatile  uint8_t *)(0x4271221CUL))

#define bFM_MFS9_I2C_ISMK_EN                      *((volatile  uint8_t *)(0x4271223CUL))
#define bFM4_MFS9_I2C_ISMK_EN                     *((volatile  uint8_t *)(0x4271223CUL))

#define bFM_MFS9_I2C_SMR_TIE                      *((volatile  uint8_t *)(0x42712008UL))
#define bFM4_MFS9_I2C_SMR_TIE                     *((volatile  uint8_t *)(0x42712008UL))
#define bFM_MFS9_I2C_SMR_RIE                      *((volatile  uint8_t *)(0x4271200CUL))
#define bFM4_MFS9_I2C_SMR_RIE                     *((volatile  uint8_t *)(0x4271200CUL))

#define bFM_MFS9_I2C_SSR_TBI                      *((volatile  uint8_t *)(0x427120A0UL))
#define bFM4_MFS9_I2C_SSR_TBI                     *((volatile  uint8_t *)(0x427120A0UL))
#define bFM_MFS9_I2C_SSR_TDRE                     *((volatile  uint8_t *)(0x427120A4UL))
#define bFM4_MFS9_I2C_SSR_TDRE                    *((volatile  uint8_t *)(0x427120A4UL))
#define bFM_MFS9_I2C_SSR_RDRF                     *((volatile  uint8_t *)(0x427120A8UL))
#define bFM4_MFS9_I2C_SSR_RDRF                    *((volatile  uint8_t *)(0x427120A8UL))
#define bFM_MFS9_I2C_SSR_ORE                      *((volatile  uint8_t *)(0x427120ACUL))
#define bFM4_MFS9_I2C_SSR_ORE                     *((volatile  uint8_t *)(0x427120ACUL))
#define bFM_MFS9_I2C_SSR_TBIE                     *((volatile  uint8_t *)(0x427120B0UL))
#define bFM4_MFS9_I2C_SSR_TBIE                    *((volatile  uint8_t *)(0x427120B0UL))
#define bFM_MFS9_I2C_SSR_DMA                      *((volatile  uint8_t *)(0x427120B4UL))
#define bFM4_MFS9_I2C_SSR_DMA                     *((volatile  uint8_t *)(0x427120B4UL))
#define bFM_MFS9_I2C_SSR_TSET                     *((volatile  uint8_t *)(0x427120B8UL))
#define bFM4_MFS9_I2C_SSR_TSET                    *((volatile  uint8_t *)(0x427120B8UL))
#define bFM_MFS9_I2C_SSR_REC                      *((volatile  uint8_t *)(0x427120BCUL))
#define bFM4_MFS9_I2C_SSR_REC                     *((volatile  uint8_t *)(0x427120BCUL))

#define bFM_MFS9_LIN_BGR_EXT                      *((volatile  uint8_t *)(0x427121BCUL))
#define bFM4_MFS9_LIN_BGR_EXT                     *((volatile  uint8_t *)(0x427121BCUL))

