mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2gkxh/common/s6e2gkxh.h
#define bFM_USB1_EP5C_STAL                        *((volatile  uint16_t*)(0x42A84724UL))
#define bFM4_USB1_EP5C_STAL                       *((volatile  uint16_t*)(0x42A84724UL))
#define bFM_USB1_EP5C_NULE                        *((volatile  uint16_t*)(0x42A84728UL))
#define bFM4_USB1_EP5C_NULE                       *((volatile  uint16_t*)(0x42A84728UL))
#define bFM_USB1_EP5C_DMAE                        *((volatile  uint16_t*)(0x42A8472CUL))
#define bFM4_USB1_EP5C_DMAE                       *((volatile  uint16_t*)(0x42A8472CUL))
#define bFM_USB1_EP5C_DIR                         *((volatile  uint16_t*)(0x42A84730UL))
#define bFM4_USB1_EP5C_DIR                        *((volatile  uint16_t*)(0x42A84730UL))
#define bFM_USB1_EP5C_EPEN                        *((volatile  uint16_t*)(0x42A8473CUL))
#define bFM4_USB1_EP5C_EPEN                       *((volatile  uint16_t*)(0x42A8473CUL))

#define bFM_USB1_EP5S_SPK                         *((volatile  uint16_t*)(0x42A84BA4UL))
#define bFM4_USB1_EP5S_SPK                        *((volatile  uint16_t*)(0x42A84BA4UL))
#define bFM_USB1_EP5S_DRQ                         *((volatile  uint16_t*)(0x42A84BA8UL))
#define bFM4_USB1_EP5S_DRQ                        *((volatile  uint16_t*)(0x42A84BA8UL))
#define bFM_USB1_EP5S_BUSY                        *((volatile  uint16_t*)(0x42A84BACUL))
#define bFM4_USB1_EP5S_BUSY                       *((volatile  uint16_t*)(0x42A84BACUL))
#define bFM_USB1_EP5S_SPKIE                       *((volatile  uint16_t*)(0x42A84BB4UL))
#define bFM4_USB1_EP5S_SPKIE                      *((volatile  uint16_t*)(0x42A84BB4UL))
#define bFM_USB1_EP5S_DRQIE                       *((volatile  uint16_t*)(0x42A84BB8UL))
#define bFM4_USB1_EP5S_DRQIE                      *((volatile  uint16_t*)(0x42A84BB8UL))
#define bFM_USB1_EP5S_BFINI                       *((volatile  uint16_t*)(0x42A84BBCUL))
#define bFM4_USB1_EP5S_BFINI                      *((volatile  uint16_t*)(0x42A84BBCUL))

#define bFM_USB1_HCNT_HOST                        *((volatile  uint8_t *)(0x42A84000UL))
#define bFM4_USB1_HCNT_HOST                       *((volatile  uint8_t *)(0x42A84000UL))
#define bFM_USB1_HCNT_URST                        *((volatile  uint8_t *)(0x42A84004UL))
#define bFM4_USB1_HCNT_URST                       *((volatile  uint8_t *)(0x42A84004UL))
#define bFM_USB1_HCNT_SOFIRE                      *((volatile  uint8_t *)(0x42A84008UL))
#define bFM4_USB1_HCNT_SOFIRE                     *((volatile  uint8_t *)(0x42A84008UL))
#define bFM_USB1_HCNT_DIRE                        *((volatile  uint8_t *)(0x42A8400CUL))
#define bFM4_USB1_HCNT_DIRE                       *((volatile  uint8_t *)(0x42A8400CUL))
#define bFM_USB1_HCNT_CNNIRE                      *((volatile  uint8_t *)(0x42A84010UL))
#define bFM4_USB1_HCNT_CNNIRE                     *((volatile  uint8_t *)(0x42A84010UL))
#define bFM_USB1_HCNT_CMPIRE                      *((volatile  uint8_t *)(0x42A84014UL))
#define bFM4_USB1_HCNT_CMPIRE                     *((volatile  uint8_t *)(0x42A84014UL))
#define bFM_USB1_HCNT_URIRE                       *((volatile  uint8_t *)(0x42A84018UL))
#define bFM4_USB1_HCNT_URIRE                      *((volatile  uint8_t *)(0x42A84018UL))
#define bFM_USB1_HCNT_RWKIRE                      *((volatile  uint8_t *)(0x42A8401CUL))
#define bFM4_USB1_HCNT_RWKIRE                     *((volatile  uint8_t *)(0x42A8401CUL))
#define bFM_USB1_HCNT_RETRY                       *((volatile  uint8_t *)(0x42A84020UL))
#define bFM4_USB1_HCNT_RETRY                      *((volatile  uint8_t *)(0x42A84020UL))
#define bFM_USB1_HCNT_CANCEL                      *((volatile  uint8_t *)(0x42A84024UL))
#define bFM4_USB1_HCNT_CANCEL                     *((volatile  uint8_t *)(0x42A84024UL))
#define bFM_USB1_HCNT_SOFSTEP                     *((volatile  uint8_t *)(0x42A84028UL))
#define bFM4_USB1_HCNT_SOFSTEP                    *((volatile  uint8_t *)(0x42A84028UL))

#define bFM_USB1_HERR_STUFF                       *((volatile  uint8_t *)(0x42A840A8UL))
#define bFM4_USB1_HERR_STUFF                      *((volatile  uint8_t *)(0x42A840A8UL))
#define bFM_USB1_HERR_TGERR                       *((volatile  uint8_t *)(0x42A840ACUL))
#define bFM4_USB1_HERR_TGERR                      *((volatile  uint8_t *)(0x42A840ACUL))
#define bFM_USB1_HERR_CRC                         *((volatile  uint8_t *)(0x42A840B0UL))
#define bFM4_USB1_HERR_CRC                        *((volatile  uint8_t *)(0x42A840B0UL))
#define bFM_USB1_HERR_TOUT                        *((volatile  uint8_t *)(0x42A840B4UL))
#define bFM4_USB1_HERR_TOUT                       *((volatile  uint8_t *)(0x42A840B4UL))
#define bFM_USB1_HERR_RERR                        *((volatile  uint8_t *)(0x42A840B8UL))
#define bFM4_USB1_HERR_RERR                       *((volatile  uint8_t *)(0x42A840B8UL))
#define bFM_USB1_HERR_LSTSOF                      *((volatile  uint8_t *)(0x42A840BCUL))
#define bFM4_USB1_HERR_LSTSOF                     *((volatile  uint8_t *)(0x42A840BCUL))

#define bFM_USB1_HIRQ_SOFIRQ                      *((volatile  uint8_t *)(0x42A84080UL))
#define bFM4_USB1_HIRQ_SOFIRQ                     *((volatile  uint8_t *)(0x42A84080UL))
#define bFM_USB1_HIRQ_DIRQ                        *((volatile  uint8_t *)(0x42A84084UL))
#define bFM4_USB1_HIRQ_DIRQ                       *((volatile  uint8_t *)(0x42A84084UL))
#define bFM_USB1_HIRQ_CNNIRQ                      *((volatile  uint8_t *)(0x42A84088UL))
#define bFM4_USB1_HIRQ_CNNIRQ                     *((volatile  uint8_t *)(0x42A84088UL))
#define bFM_USB1_HIRQ_CMPIRQ                      *((volatile  uint8_t *)(0x42A8408CUL))
#define bFM4_USB1_HIRQ_CMPIRQ                     *((volatile  uint8_t *)(0x42A8408CUL))
#define bFM_USB1_HIRQ_URIRQ                       *((volatile  uint8_t *)(0x42A84090UL))
#define bFM4_USB1_HIRQ_URIRQ                      *((volatile  uint8_t *)(0x42A84090UL))
#define bFM_USB1_HIRQ_RWKIRQ                      *((volatile  uint8_t *)(0x42A84094UL))
#define bFM4_USB1_HIRQ_RWKIRQ                     *((volatile  uint8_t *)(0x42A84094UL))
#define bFM_USB1_HIRQ_TCAN                        *((volatile  uint8_t *)(0x42A8409CUL))
#define bFM4_USB1_HIRQ_TCAN                       *((volatile  uint8_t *)(0x42A8409CUL))

#define bFM_USB1_HSTATE_CSTAT                     *((volatile  uint8_t *)(0x42A84100UL))
#define bFM4_USB1_HSTATE_CSTAT                    *((volatile  uint8_t *)(0x42A84100UL))
#define bFM_USB1_HSTATE_TMODE                     *((volatile  uint8_t *)(0x42A84104UL))
#define bFM4_USB1_HSTATE_TMODE                    *((volatile  uint8_t *)(0x42A84104UL))
#define bFM_USB1_HSTATE_SUSP                      *((volatile  uint8_t *)(0x42A84108UL))
#define bFM4_USB1_HSTATE_SUSP                     *((volatile  uint8_t *)(0x42A84108UL))
#define bFM_USB1_HSTATE_SOFBUSY                   *((volatile  uint8_t *)(0x42A8410CUL))
#define bFM4_USB1_HSTATE_SOFBUSY                  *((volatile  uint8_t *)(0x42A8410CUL))
#define bFM_USB1_HSTATE_CLKSEL                    *((volatile  uint8_t *)(0x42A84110UL))
#define bFM4_USB1_HSTATE_CLKSEL                   *((volatile  uint8_t *)(0x42A84110UL))
#define bFM_USB1_HSTATE_ALIVE                     *((volatile  uint8_t *)(0x42A84114UL))
#define bFM4_USB1_HSTATE_ALIVE                    *((volatile  uint8_t *)(0x42A84114UL))

#define bFM_USB1_HTOKEN_TGGL                      *((volatile  uint8_t *)(0x42A8439CUL))
#define bFM4_USB1_HTOKEN_TGGL                     *((volatile  uint8_t *)(0x42A8439CUL))

#define bFM_USB1_UDCC_PWC                         *((volatile  uint8_t *)(0x42A84400UL))
#define bFM4_USB1_UDCC_PWC                        *((volatile  uint8_t *)(0x42A84400UL))
#define bFM_USB1_UDCC_RFBK                        *((volatile  uint8_t *)(0x42A84404UL))
#define bFM4_USB1_UDCC_RFBK                       *((volatile  uint8_t *)(0x42A84404UL))
#define bFM_USB1_UDCC_STALCLREN                   *((volatile  uint8_t *)(0x42A8440CUL))
#define bFM4_USB1_UDCC_STALCLREN                  *((volatile  uint8_t *)(0x42A8440CUL))
#define bFM_USB1_UDCC_USTP                        *((volatile  uint8_t *)(0x42A84410UL))
#define bFM4_USB1_UDCC_USTP                       *((volatile  uint8_t *)(0x42A84410UL))
#define bFM_USB1_UDCC_HCONX                       *((volatile  uint8_t *)(0x42A84414UL))
#define bFM4_USB1_UDCC_HCONX                      *((volatile  uint8_t *)(0x42A84414UL))
#define bFM_USB1_UDCC_RESUM                       *((volatile  uint8_t *)(0x42A84418UL))
#define bFM4_USB1_UDCC_RESUM                      *((volatile  uint8_t *)(0x42A84418UL))
#define bFM_USB1_UDCC_RST                         *((volatile  uint8_t *)(0x42A8441CUL))
#define bFM4_USB1_UDCC_RST                        *((volatile  uint8_t *)(0x42A8441CUL))

